---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AlignedFreeFormSetOrientationOptions
source: html/43225713-26d8-279f-578d-341d850e51a8.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AlignedFreeFormSetOrientationOptions Property

Orientation options for an Aligned Free Form Rebar set.

## Syntax (C#)
```csharp
public AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions { get; }
```